### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # kubernetes_storage_class_v1.efs[0] will be created
+   resource "kubernetes_storage_class_v1" "efs" {
+       allow_volume_expansion = true
+       id                     = (known after apply)
+       parameters             = (known after apply)
+       reclaim_policy         = "Retain"
+       storage_provisioner    = "efs.csi.aws.com"
+       volume_binding_mode    = "Immediate"

+       metadata {
+           generation       = (known after apply)
+           name             = "jingood2-dev-efs"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.efs.data.aws_iam_policy_document.policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policy" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "*",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "NonSecureTransport"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "AWS"
            }
        }
    }

  # module.efs.aws_efs_backup_policy.this[0] will be created
+   resource "aws_efs_backup_policy" "this" {
+       file_system_id = (known after apply)
+       id             = (known after apply)

+       backup_policy {
+           status = "ENABLED"
        }
    }

  # module.efs.aws_efs_file_system.this[0] will be created
+   resource "aws_efs_file_system" "this" {
+       arn                     = (known after apply)
+       availability_zone_id    = (known after apply)
+       availability_zone_name  = (known after apply)
+       creation_token          = "jingood2-dev-efs"
+       dns_name                = (known after apply)
+       encrypted               = true
+       id                      = (known after apply)
+       kms_key_id              = (known after apply)
+       number_of_mount_targets = (known after apply)
+       owner_id                = (known after apply)
+       performance_mode        = "generalPurpose"
+       size_in_bytes           = (known after apply)
+       tags                    = {
+           "Name"        = "jingood2-dev-efs"
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all                = {
+           "Name"        = "jingood2-dev-efs"
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       throughput_mode         = "bursting"
    }

  # module.efs.aws_efs_file_system_policy.this[0] will be created
+   resource "aws_efs_file_system_policy" "this" {
+       bypass_policy_lockout_safety_check = false
+       file_system_id                     = (known after apply)
+       id                                 = (known after apply)
+       policy                             = (known after apply)
    }

  # module.efs.aws_efs_mount_target.this["subnet-0295d3a037cfc7c23"] will be created
+   resource "aws_efs_mount_target" "this" {
+       availability_zone_id   = (known after apply)
+       availability_zone_name = (known after apply)
+       dns_name               = (known after apply)
+       file_system_arn        = (known after apply)
+       file_system_id         = (known after apply)
+       id                     = (known after apply)
+       ip_address             = (known after apply)
+       mount_target_dns_name  = (known after apply)
+       network_interface_id   = (known after apply)
+       owner_id               = (known after apply)
+       security_groups        = (known after apply)
+       subnet_id              = "subnet-0295d3a037cfc7c23"
    }

  # module.efs.aws_efs_mount_target.this["subnet-0d102e9e62c553f9a"] will be created
+   resource "aws_efs_mount_target" "this" {
+       availability_zone_id   = (known after apply)
+       availability_zone_name = (known after apply)
+       dns_name               = (known after apply)
+       file_system_arn        = (known after apply)
+       file_system_id         = (known after apply)
+       id                     = (known after apply)
+       ip_address             = (known after apply)
+       mount_target_dns_name  = (known after apply)
+       network_interface_id   = (known after apply)
+       owner_id               = (known after apply)
+       security_groups        = (known after apply)
+       subnet_id              = "subnet-0d102e9e62c553f9a"
    }

  # module.efs.aws_security_group.this[0] will be created
+   resource "aws_security_group" "this" {
+       arn                    = (known after apply)
+       description            = "jingood2-dev EFS security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "jingood2-dev-efs-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = true
+       tags                   = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all               = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       vpc_id                 = "vpc-001360522b20e3855"
    }

  # module.efs.aws_security_group_rule.this["vpc"] will be created
+   resource "aws_security_group_rule" "this" {
+       cidr_blocks              = [
+           "10.0.11.0/24",
+           "10.0.10.0/24",
        ]
+       description              = "EFS ingress from VPC private subnets"
+       from_port                = 2049
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 2049
+       type                     = "ingress"
    }

  # module.kubernetes_addons.module.argocd[0].helm_release.argocd_application["addons"] will be updated in-place
!   resource "helm_release" "argocd_application" {
        id                         = "addons"
        name                       = "addons"
        # (27 unchanged attributes hidden)

-       set {
-           name  = "source.helm.values" -> null
-           type  = "auto" -> null
-           value = <<-EOT
                "account": "484752921218"
                "clusterName": "jingood2-dev-eks"
                "region": "us-east-1"
                "repoUrl": "https://github.com/aws-samples/eks-blueprints-add-ons.git"
            EOT -> null
        }
+       set {
+           name  = "source.helm.values"
+           type  = "auto"
+           value = <<-EOT
                "account": "484752921218"
                "awsEfsCsiDriver":
                  "enable": true
                  "serviceAccountName": "aws-efs-csi-driver-sa"
                "clusterName": "jingood2-dev-eks"
                "region": "us-east-1"
                "repoUrl": "https://github.com/aws-samples/eks-blueprints-add-ons.git"
            EOT
        }

        # (7 unchanged blocks hidden)
    }

  # module.kubernetes_addons.module.aws_efs_csi_driver[0].aws_iam_policy.aws_efs_csi_driver will be created
+   resource "aws_iam_policy" "aws_efs_csi_driver" {
+       arn         = (known after apply)
+       description = "IAM Policy for AWS EFS CSI Driver"
+       id          = (known after apply)
+       name        = "jingood2-dev-eks-efs-csi-policy"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "ec2:DescribeAvailabilityZones"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AllowDescribeAvailabilityZones"
                    },
+                   {
+                       Action   = [
+                           "elasticfilesystem:DescribeMountTargets",
+                           "elasticfilesystem:DescribeFileSystems",
+                           "elasticfilesystem:DescribeAccessPoints",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:elasticfilesystem:us-east-1:484752921218:file-system/*",
+                           "arn:aws:elasticfilesystem:us-east-1:484752921218:access-point/*",
                        ]
+                       Sid      = "AllowDescribeFileSystems"
                    },
+                   {
+                       Action    = "elasticfilesystem:CreateAccessPoint"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/efs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:elasticfilesystem:us-east-1:484752921218:file-system/*"
+                       Sid       = "AllowCreateAccessPoint"
                    },
+                   {
+                       Action    = "elasticfilesystem:DeleteAccessPoint"
+                       Condition = {
+                           StringLike = {
+                               "aws:ResourceTag/efs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:elasticfilesystem:us-east-1:484752921218:access-point/*"
+                       Sid       = "AllowDeleteAccessPoint"
                    },
+                   {
+                       Action    = [
+                           "elasticfilesystem:ClientWrite",
+                           "elasticfilesystem:ClientRootAccess",
+                           "elasticfilesystem:ClientMount",
                        ]
+                       Condition = {
+                           Bool = {
+                               "elasticfilesystem:AccessedViaMountTarget" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:elasticfilesystem:us-east-1:484752921218:file-system/*"
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.kubernetes_addons.module.aws_efs_csi_driver[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0] will be created
+   resource "aws_iam_role" "irsa" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringLike = {
+                               "oidc.eks.us-east-1.amazonaws.com/id/226AC3B8497FDABD5F19766D997CA0E2:aud" = "sts.amazonaws.com"
+                               "oidc.eks.us-east-1.amazonaws.com/id/226AC3B8497FDABD5F19766D997CA0E2:sub" = "system:serviceaccount:kube-system:aws-efs-csi-driver-sa"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::484752921218:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/226AC3B8497FDABD5F19766D997CA0E2"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "AWS IAM Role for the Kubernetes service account aws-efs-csi-driver-sa."
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "jingood2-dev-eks-aws-efs-csi-driver-sa-irsa"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.kubernetes_addons.module.aws_efs_csi_driver[0].module.helm_addon.module.irsa[0].aws_iam_role_policy_attachment.irsa[0] will be created
+   resource "aws_iam_role_policy_attachment" "irsa" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "jingood2-dev-eks-aws-efs-csi-driver-sa-irsa"
    }

  # module.kubernetes_addons.module.aws_efs_csi_driver[0].module.helm_addon.module.irsa[0].kubernetes_service_account_v1.irsa[0] will be created
+   resource "kubernetes_service_account_v1" "irsa" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           annotations      = (known after apply)
+           generation       = (known after apply)
+           name             = "aws-efs-csi-driver-sa"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 12 to add, 1 to change, 0 to destroy.
```
</details>